apache/nuttx/arch/arm/src/lpc11xx/lpc11_serial.c
static inline void up_disableuartint(struct up_dev_s *priv, uint32_t *ier)
{
  if (ier)
    {
      *ier = priv->ier & UART_IER_ALLIE;
    }

  priv->ier &= ~UART_IER_ALLIE;
  up_serialout(priv, LPC11_UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

static inline void up_restoreuartint(struct up_dev_s *priv, uint32_t ier)
{
  priv->ier |= ier & UART_IER_ALLIE;
  up_serialout(priv, LPC11_UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: up_enablebreaks
 ****************************************************************************/

static inline void up_enablebreaks(struct up_dev_s *priv, bool enable)
{
  uint32_t lcr = up_serialin(priv, LPC11_UART_LCR_OFFSET);

  if (enable)
    {
      lcr |= UART_LCR_BRK;
    }
  else
    {
      lcr &= ~UART_LCR_BRK;
    }

  up_serialout(priv, LPC11_UART_LCR_OFFSET, lcr);
}

/************************************************************************************
 * Name: lpc11_uartcclkdiv
 *
 * Description:
 *   Select a CCLK divider to produce the UART PCLK.  The strategy is to select the
 *   smallest divisor that results in an solution within range of the 16-bit
 *   DLM and DLL divisor:
 *
 *     PCLK = MCLK / divisor
 *     BAUD = PCLK / (16 * DL)
 *
 *   Ignoring the fractional divider for now. (If you want to extend this driver
 *   to support the fractional divider, see lpc43xx_uart.c.  The LPC43xx uses
 *   the same peripheral and that logic could easily leveraged here).
 *
 *   For the LPC111x the PCLK is determined by the UART-specific divisor in
 *   PCLKSEL0 or PCLKSEL1:
 *
 *     PCLK = MCLK / divisor
 *
 *   For the LPC111x, the PCLK is determined by the global divisor setting in
 *   the PLKSEL register (and, in that case, this function is not needed).
 *
 *   NOTE:  This is an inline function.  If a typical optimization level is used and
 *   a constant is provided for the desired frequency, then most of the following
 *   logic will be optimized away.
 *
 ************************************************************************************/

#ifdef LPC111x
static inline uint32_t lpc11_uartcclkdiv(uint32_t baud)
{
  /* Ignoring the fractional divider, the BAUD is given by:
   *
   *   BAUD = PCLK / (16 * DL), or
   *   DL   = PCLK / BAUD / 16
   *
   * Where for the LPC111x the PCLK is determined by the UART-specific divisor in
   * :
   *
   *   UART_PCLK = MAIN_CLOCK / divisor
   *
   */

  /* Calculate and optimal PCLKSEL0/1 divisor.
   * First, check divisor == 1.  This works if the upper limit is met:
   *
   *   DL < 0xffff, or
   *   PCLK / BAUD / 16 < 0xffff, or
   *   MCLK / BAUD / 16 < 0xffff, or
   *   MCLK < BAUD * 0xffff * 16
   *   BAUD > MCLK / 0xffff / 16
   *
   * And the lower limit is met (we can't allow DL to get very close to one).
   *
   *   DL >= MinDL
   *   MCLK / BAUD / 16 >= MinDL, or
   *   BAUD <= CCLK / 16 / MinDL
   */

  return 1;
}
#endif /* LPC111x */

/************************************************************************************
 * Name: lpc11_uart0config
 *
 * Description:
 *   Configure the UART.  UART0 peripherals are configured using the following
 *   registers:
 *
 *   1. Power: In the PCONP register, set bits PCUART0.
 *      On reset, UART0 and UART 1 are enabled (PCUART0 = 1 and PCUART1 = 1)
 *      and UART2/3 are disabled (PCUART1 = 0 and PCUART3 = 0).
 *   2. Peripheral clock: In the PCLKSEL0 register, select PCLK_UART0 and
 *      PCLK_UART1; in the PCLKSEL1 register, select PCLK_UART2 and PCLK_UART3.
 *   3. Pins: Select UART pins through the PINSEL registers and pin modes
 *      through the PINMODE registers. UART receive pins should not have
 *      pull-down resistors enabled.
 *
 ************************************************************************************/

#ifdef CONFIG_LPC11_UART0
static inline void lpc11_uart0config(void)
{
  uint32_t   regval;
  irqstate_t flags;

  /* Step 1: Pins configuration */

  flags   = enter_critical_section();
  lpc11_configgpio(GPIO_UART0_TXD);
  lpc11_configgpio(GPIO_UART0_RXD);

  /* Step 2: Enable power on UART0 */

  regval = getreg32(LPC11_SYSCON_SYSAHBCLKCTRL);
  regval |= SYSCON_SYSAHBCLKCTRL_UART;
  putreg32(regval, LPC11_SYSCON_SYSAHBCLKCTRL);

  /* Step 3: Enable clocking UART */

  putreg32(1, LPC11_SYSCON_UARTCLKDIV);
  leave_critical_section(flags);
};
#endif

/************************************************************************************
 * Name: lpc11_uartdl
 *
 * Description:
 *   Select a divider to produce the BAUD from the UART PCLK.
 *
 *     BAUD = PCLK / (16 * DL), or
 *     DL   = PCLK / BAUD / 16
 *
 *   Ignoring the fractional divider for now. (If you want to extend this driver
 *   to support the fractional divider, see lpc43xx_uart.c.  The LPC43xx uses
 *   the same peripheral and that logic could easily leveraged here).
 *
 ************************************************************************************/

#ifdef LPC111x
static inline uint32_t lpc11_uartdl(uint32_t baud, uint8_t divcode)
{
  /* TODO: Calculate DL automatically */

  uint32_t num = 312;

  return num;
}
#else
static inline uint32_t lpc11_uartdl(uint32_t baud)
{
  return (uint32_t)BOARD_PCLK_FREQUENCY / (baud << 4);
}
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, fifos, etc. This method is
 *   called the first time that the serial port is opened.
 *
 ****************************************************************************/

static int up_setup(struct uart_dev_s *dev)
{
#ifndef CONFIG_SUPPRESS_UART_CONFIG
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint16_t dl;
  uint32_t lcr;

  /* Clear fifos */

